backend/loadtest4o1.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Warm up the API
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up to peak load
    - duration: 60
      arrivalRate: 50
      name: Sustained peak load
  engines:
   socketio-v3: {}
  processor: "./custom.js" # set a custom processor to load dynamic scenario data

scenarios:
  - name: "Full Chat-Szenario"
    engine: socketio-v3
    flow:
      - function: "getChatData" # load variables
      - emit:
          channel: "createUser"
          data: "{{ name }}"
        acknowledge: true
      - emit:
          channel: "joinChatRoom"
          data: "testroom"
        acknowledge: true
      - emit:
          channel: "chatMessage"
          data: "{{ greeting }}"
      - think: 5
      - emit:
          channel: "chatMessage"
          data: "{{ goodbye }}"
      - emit:
          channel: "leaveChatRoom"
          data: "testroom"
        acknowledge: true

      - think: 5